# RebarShapeDefinitionBySegments Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeDefinitionBySegments Methods
RebarShapeDefinitionBySegments Class See Also
---
The RebarShapeDefinitionBySegments type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddBendDefaultRadius | Specify a default-radius bend. |
| AddBendVariableRadius | Specify a variable-radius bend. |
| AddConstraintParallelToSegment | Constrain the length of a segment by parameterizing its length. |
| AddConstraintToSegment | Add a constraint that helps determine the length of a segment. |
| AddFormulaParameter | Add a formula-driven parameter to the shape definition.  (Inherited from RebarShapeDefinition.) |
| AddListeningDimensionBendToBend | Specify a dimension between two bends, measured by a read-only parameter. |
| AddListeningDimensionSegmentToBend | Specify a dimension perpendicular to one fixed-direction segment, referring to that segment and some other bend in the shape, measured by a read-only parameter. |
| AddListeningDimensionSegmentToSegment | Specify a dimension perpendicular to two fixed-direction segments, measured by a read-only parameter. |
| AddParameter | Add a parameter to the shape definition.  (Inherited from RebarShapeDefinition.) |
| CheckDefaultParameterValues | Check that the shape can be solved with the default parameter values.  (Inherited from RebarShapeDefinition.) |
| Dispose | (Inherited from RebarShapeDefinition.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParameterDefaultValue | Return the parameter's default value as stored in the definition.  (Inherited from RebarShapeDefinition.) |
| GetParameterFormula | Return the parameter's formula, if one is associated with it.  (Inherited from RebarShapeDefinition.) |
| GetParameters | Return the Ids of the shared parameters in the Definition.  (Inherited from RebarShapeDefinition.) |
| GetSegment | Return a reference to one of the segments in the definition. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetVertex | Return a reference to one of the vertices in the definition. |
| HasParameter | Whether the definition stores the parameter.  (Inherited from RebarShapeDefinition.) |
| RemoveParameter | Remove the parameter from the definition.  (Inherited from RebarShapeDefinition.) |
| RemoveParameterFromSegment | Remove constraints from a segment. |
| SetParameterDefaultValue | Change the parameter's value as stored in the definition.  (Inherited from RebarShapeDefinition.) |
| SetParameterFormula | Associate a formula with the parameter.  (Inherited from RebarShapeDefinition.) |
| SetSegmentAs180DegreeBend(Int32) | Indicates that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be taken from the Bar Type. |
| SetSegmentAs180DegreeBend(Int32, ElementId, Boolean) | Indicate that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be driven by radiusParam. |
| SetSegmentFixedDirection | Fix the direction of a segment. |
| SetSegmentVariableDirection | Remove the fixed direction from a segment. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace